"""
Здесь настройки кнопок
"""
# ==========================Общие настройки==========================
# Ширина кнопок фрейма (в количестве вмещаемых символов) по умолчанию
BUTTONS_WIDTH = 15  # Default: 15

# Отступы по горизонтали слева и справа для кнопок внутри фрейма
# по умолчанию
BUTTONS_PADX = 5  # Default: 5

# Размещение кнопок внутри фрейма с учетом других кнопок по умолчанию
# При указании одной и той же стороны, элементы будут прижаты друг к другу
# с учетом отступов.
# Возможные варианты:
# 'left' - слева
# 'right' - справа
# 'top' - сверху
# 'botton' - снизу
BUTTONS_SIDE = 'left'  # Default: 'left'

# ====================Настройки для кнопки ОБЗОР=====================

# Текст кнопки возле текстового поля
BROWSE_BUTTON_TEXT = 'Обзор'  # Default: 'Обзор'

# Размещение кнопки внутри фрейма
# При указании одной и той же стороны, элементы будут прижаты друг к другу
# с учетом отступов.
# 'left' - слева
# 'right' - справа
# 'top' - сверху
# 'botton' - снизу
BROWSE_BUTTON_SIDE = 'right'  # Default: 'right'

# Отступ слева от кнопки
BROWSE_BUTTON_LEFT_PADX = 10  # Default: 10

# Отступ справа от кнопки
BROWSE_BUTTON_RIGHT_PADX = 0  # Default: 0
