"""
Здесь настройки текстовых полей для ввода текста
"""

# Ширина поля (в количестве символов)
TEXT_FIELD_WIDTH = 50  # Default: 50

# Размещение поля внутри фрейма
# При указании одной и той же стороны, элементы будут прижаты друг к другу
# с учетом отступов.
# 'left' - слева
# 'right' - справа
# 'top' - сверху
# 'botton' - снизу
TEXT_FIELD_FRAME_SIDE = 'left'  # Default: 'left'

# Выбор оси, по которой будет растягивание поля (лучше не менять этот параметр)
TEXT_FIELD_FILL_AXIS = 'x'  # Default: 'x'

# Растяжение поля при изменении размеров главного окна
TEXT_FIELD_EXPAND = True  # Default: True
