"""
Здесь будут храниться настройки стартового окна.
"""

# Имя Главного окна
# Default: "Dates Control - v1.0.0"
START_WINDOW_TITLE = "Dates Control - v1.0.0"

# Имя окна настроек
# Default: "Настройки"
SETTINGS_WINDOW_TITLE = "Настройки"

# Размеры стартового окна
WINDOW_WIDTH = 600  # Default: 600
WINDOW_HEIGHT = 400  # Default: 400

# ===================Настройки работы с иконками=====================

# Имя папки, в которой хранятся иконки.
ICONS_FOLDER_NAME = "icons"  # Default: icons

# Имя файла иконки приложения, которая будет отображаться в углу приложения
PNG_ICON_FILENAME = "mark32x32.png"

# Имя файла иконки приложения, которая будет отображаться в панели задач
ICO_ICON_FILENAME = "mark32x32.ico"

# Путь к .png иконке приложеня
PNG_ICON_FILEPATH = "icons/mark32x32.png"

# Путь к .ico иконке приложеня
ICO_ICON_FILEPATH = "icons/mark32x32.ico"

# =================Настройки для метода browse_file==================

# Стартовый элемент очистки текстового поля и вставки в него
# рекомендуется не менять
FIRST_ELEMENT = 0  # Default: 0

# Разделитель пути файлов, если выбрано несколько файлов в одном тестовом поле
PATH_DIVIDER = '; '  # Default: '; '
